{
  "auto_mapping": {
    "base_model_class": "VisionEncoderDecoderModel",
    "parent_library": "transformers.models.vision_encoder_decoder.modeling_vision_encoder_decoder"
  },
  "base_model_name_or_path": "microsoft/trocr-base-handwritten",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "revision": null,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": null
}